vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA142_DFP.pdsc
            __var ap0_disable=0x55aa;
            
            //Halt the core
            Write32(DHCSR_Addr, 0xA05F0003);
            //clear VECTOR CATCH and set TRCENA
            tmp = Read32(DEMCR_Addr);
            Write32(DEMCR_Addr, tmp | 0x1000000);
            
            __errorcontrol = 1;
            
            // Set watch point
            Write32(0xE0001020, 0x40091036);
            Write32(0xE0001028, 0xF0000412);
            Write32(0xE0001030, 0x40091040);
            Write32(0xE0001038, 0xF0000403);
            
            __errorcontrol = 1;
            // Execute SYSRESETREQ via AIRCR
            Write32(AIRCR_Addr, 0x05FA0004);
            
            __dp = 0;
            __ap = 1;
            WriteAP(0x0, 0x20);
            
            __errorcontrol = 0;
            
            // Give bootloader time to do what it needs to do
            DAP_Delay(BootTime);  // try 10ms
            
            // Read AP0 CSW
            __dp = 0;
            __ap = 0;
            ap0_disable = ReadAP(0x0);
            ap0_disable = ((ap0_disable &amp; 0x40) == 0);
            ////Message(0, "AP0 DIS: %x", ap0_disable);
            Sequence("WaitForStopAfterReset");
          </block>
        </sequence>
        <sequence name="ResetProcessor" disable="1"/>
        <sequence name="TraceStart">
          <control if="__traceout &amp; 0x1" info="SWO Trace output selected">
            <block>Sequence("EnableTraceClk");       // Enable and configure trace clock</block>
            <control if="SWO_Pin == 0" info="SWO via PIO0_2">
              <block>Write32(0x400BC088, 0x00001140); // PIO0_2 PORT0_PCR2 mux to SWO</block>
            </control>
          </control>
        </sequence>
      </sequences>
      <debugvars configfile="devices/MCXA142/arm/MCXA15X.dbgconf">
        // Debug Access Variables, can be modified by user via copies of DBGCONF files as created by uVision. Also see sub-family level.
        __var SWO_Pin               = 0;                    // Serial Wire Output pin: 0 = P0_2
        __var Dbg_CR                = 0x00000000;           // DBG_CR
        __var BootTime              = 300000;                // 300 milliseconds
      </debugvars>
      <description>
        Arm® Cortex®-M33 microcontroller with multiple high-speed connectivity, operating up to 96 MHz, serial peripherals, timers, analog and low power consumption.
      </description>
      <device Dname="MCXA142">
        <processor Dcore="Cortex-M33" Dfpu="NO_FPU" Dmpu="NO_MPU" Dtz="NO_TZ" Ddsp="NO_DSP" Dendian="Little-endian" Dclock="96000000"/>
        <environment name="iar">
          <file category="linkerfile" name="devices/MCXA142/iar/MCXA142_flash.icf"/>
        </environment>
        <memory name="BootROM" start="0x03000000" size="0x2000" access="rx"/>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x010000" access="rx" default="1" startup="1"/>
        <memory name="SRAM" start="0x20000000" size="0x4000" access="rw" default="1"/>
        <memory name="SRAMX1" start="0x04002000" size="0x1000" access="rw" default="1"/>
        <algorithm name="devices/MCXA142/arm/MCXA15X_64.FLM" start="0x00000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
        <debug svd="devices/MCXA142/MCXA142.xml"/>
        <variant Dvariant="MCXA142VLH">
          <compile header="devices/MCXA142/fsl_device_registers.h" define="CPU_MCXA142VLH"/>
        </variant>
        <variant Dvariant="MCXA142VFT">
          <compile header="devices/MCXA142/fsl_device_registers.h" define="CPU_MCXA142VFT"/>
        </variant>
        <variant Dvariant="MCXA142VFM">
          <compile header="devices/MCXA142/fsl_device_registers.h" define="CPU_MCXA142VFM"/>
        </variant>
        <variant Dvariant="MCXA142VLF">
          <compile header="devices/MCXA142/fsl_device_registers.h" define="CPU_MCXA142VLF"/>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="device.MCXA142.internal_condition">
      <accept Dname="MCXA142VFM" Dvendor="NXP:11"/>
      <accept Dname="MCXA142VFT" Dvendor="NXP:11"/>
      <accept Dname="MCXA142VLF" Dvendor="NXP:11"/>
      <accept Dname="MCXA142VLH" Dvendor="NXP:11"/>
    </condition>
    <condition id="cmake_toolchain.condition_id">
      <require condition="allOf.device=MCXA142.internal_condition"/>
    </condition>
    <condition id="allOf.device=MCXA142.internal_condition">
      <require condition="device.MCXA142.internal_condition"/>
    </condition>
    <condition id="component.button.condition_id">
      <require condition="allOf.anyOf=allOf=component.gpio_adapter, driver.gpio, component.timer_manager, device=MCXA142.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.gpio_adapter, driver.gpio, component.timer_manager, device=MCXA142.internal_condition">
      <require condition="anyOf.allOf=component.gpio_adapter, driver.gpio.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager"/>
      <require condition="device.MCXA142.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.gpio_adapter, driver.gpio.internal_condition">
      <accept condition="allOf.component.gpio_adapter, driver.gpio.internal_condition"/>
    </condition>
    <condition id="allOf.component.gpio_adapter, driver.gpio.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
    </condition>
    <condition id="component.cmsis_drivers.condition_id">
      <require condition="allOf.device=MCXA142.internal_condition"/>
    </condition>
    <condition id="component.ctimer_adapter.condition_id">
      <require condition="allOf.driver.ctimer, device=MCXA142.internal_condition"/>
    </condition>
    <condition id="allOf.driver.ctimer, device=MCXA142.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ctimer"/>
      <require condition="device.MCXA142.internal_condition"/>
    </condition>
